In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.set_option("display.max_rows", None)

In [3]:
from IPython.core.display import display, HTML
display(HTML('<style>.container { width:90% !important; }</style>'))

In [4]:
def read_files(version):
    temp = pd.read_csv('csv_files/ONET_databases/UPDATES/ONET_' + \
                       str(version) + '_Updates.csv')
    title = 'update_'+str(version)
    temp.columns = ['onetsoccode', title, 'description']
    temp.drop('description', axis=1, inplace=True)
    return temp

__Year 2000-2006__

In [5]:
update_50 = read_files(50)
update_60 = read_files(60)
update_70 = read_files(70)
update_80 = read_files(80)
update_90 = read_files(90)

In [6]:
def merge_files(f1, f2, indicator:bool):
    from copy import copy
    temp = copy(f1)
    temp = temp.merge(f2, how='outer', on='onetsoccode', indicator=indicator)
    return temp

In [7]:
df = merge_files(update_50, update_60, indicator=False)
df = merge_files(df, update_70, indicator=False)
df = merge_files(df, update_80, indicator=False)
df = merge_files(df, update_90, indicator=False)
df.head()

,onetsoccode,update_50,update_60,update_70,update_80,update_90
0,11-2022.00,Sales Managers,NaN,NaN,NaN,NaN
1,11-3011.00,Administrative Services Managers,NaN,NaN,NaN,NaN
2,11-3051.00,Industrial Production Managers,NaN,NaN,NaN,NaN
3,11-9111.00,Medical and Health Services Managers,NaN,NaN,NaN,NaN
4,13-1022.00,"Wholesale and Retail Buyers, Except Farm Products",NaN,NaN,NaN,NaN

In [8]:
df.fillna('', inplace=True)
df['title'] = df.iloc[:, 1:].sum(axis=1)
df.head()

,onetsoccode,update_50,update_60,update_70,update_80,update_90,title
0,11-2022.00,Sales Managers,,,,,Sales Managers
1,11-3011.00,Administrative Services Managers,,,,,Administrative Services Managers
2,11-3051.00,Industrial Production Managers,,,,,Industrial Production Managers
3,11-9111.00,Medical and Health Services Managers,,,,,Medical and Health Services Managers
4,13-1022.00,"Wholesale and Retail Buyers, Except Farm Products",,,,,"Wholesale and Retail Buyers, Except Farm Products"

In [9]:
df['update_50'] = np.where(df['update_50'] != '', '5.0', df['update_50'])
df['update_60'] = np.where(df['update_60'] != '', '6.0', df['update_60'])
df['update_70'] = np.where(df['update_70'] != '', '7.0', df['update_70'])
df['update_80'] = np.where(df['update_80'] != '', '8.0', df['update_80'])
df['update_90'] = np.where(df['update_90'] != '', '9.0', df['update_90'])
df['version_2000'] = df.iloc[:, 1:-1].sum(axis=1).map(str)
df.drop(['update_50', 'update_60', 'update_70', 'update_80', 'update_90'],
        axis=1, inplace=True)
df.head()

  onetsoccode                                              title version_2000
0  11-2022.00                                     Sales Managers          5.0
1  11-3011.00                   Administrative Services Managers          5.0
2  11-3051.00                     Industrial Production Managers          5.0
3  11-9111.00               Medical and Health Services Managers          5.0
4  13-1022.00  Wholesale and Retail Buyers, Except Farm Products          5.0

__Year 2006-2009__

In [10]:
update_100 = read_files(100)
update_110 = read_files(110)
update_120 = read_files(120)
update_130 = read_files(130)

In [11]:
df1 = merge_files(update_100, update_110, indicator=False)
df1 = merge_files(df1, update_120, indicator=False)
df1 = df1.merge(update_130, how='outer', on='onetsoccode', indicator=True)
df1.iloc[:, 1:-1] = df1.iloc[:, 1:-1].fillna('')

In [12]:
mask = df1['_merge'] != 'both'
df1['title'] = df1[mask].loc[:, list(df1.columns)[1:-1]].sum(axis=1)
df1['title'] = np.where(df1['title'].isnull(), df1['update_100'], df1['title'])

In [13]:
df1['update_100'] = np.where(df1['update_100'] != '', '10.0', df1['update_100'])
df1['update_110'] = np.where(df1['update_110'] != '', '11.0', df1['update_110'])
df1['update_120'] = np.where(df1['update_120'] != '', '12.0', df1['update_120'])
df1['update_130'] = np.where(df1['update_130'] != '', '13.0', df1['update_130'])

In [14]:
df1['version_2006'] = df1[mask].loc[:, list(df1.columns)[1:-2]].sum(axis=1).map(str)
df1['version_2006'] = np.where(df1['version_2006'].isnull(), df1['update_100'], df1['version_2006'])
df1['version_2006_1'] = ''
df1['version_2006_1'] = np.where(~mask, df1['update_130'], df1['version_2006_1'] )

In [15]:
df1.drop(['update_100', 'update_110', 'update_120', 'update_130', '_merge'],
         axis=1, inplace=True)
df1.head()

,onetsoccode,title,version_2006,version_2006_1
0,11-1011.00,Chief Executives,10.0,
1,11-3031.01,Treasurers and Controllers,10.0,
2,11-3031.02,"Financial Managers, Branch or Department",10.0,
3,11-9011.02,Crop and Livestock Managers,10.0,
4,13-1041.06,Coroners,10.0,

__Year 2009-2010__

In [16]:
update_140 = read_files(140)
update_150 = read_files(150)

In [17]:
df2 = merge_files(update_140, update_150, indicator=False)

In [18]:
df2.fillna('', inplace=True)
df2['title'] = df2.iloc[:, 1:].sum(axis=1)
df2['update_140'] = np.where(df2['update_140'] != '', '14.0', df2['update_140'])
df2['update_150'] = np.where(df2['update_150'] != '', '15.0', df2['update_150'])
df2['version_2009'] = df2.iloc[:, 1:-1].sum(axis=1).map(str)
df2.drop(['update_140', 'update_150'], axis=1, inplace=True)
df2.head()

  onetsoccode                             title version_2009
0  11-2031.00         Public Relations Managers         14.0
1  11-3011.00  Administrative Services Managers         14.0
2  11-3061.00               Purchasing Managers         14.0
3  11-3071.01           Transportation Managers         14.0
4  11-9111.01        Clinical Nurse Specialists         14.0

__Year 2010 +__

In [19]:
update_160 = read_files(160)
update_170 = read_files(170)
update_180 = read_files(180)
update_190 = read_files(190)
update_200 = read_files(200)
update_210 = read_files(210)
update_220 = read_files(220)
update_230 = read_files(230)

In [20]:
df3 = merge_files(update_160, update_170, indicator='_17')
df3 = merge_files(df3, update_180, indicator='_18')
df3 = merge_files(df3, update_190, indicator='_19')
df3 = merge_files(df3, update_200, indicator='_20')
df3 = merge_files(df3, update_210, indicator='_21')
df3 = merge_files(df3, update_220, indicator='_22')
df3 = merge_files(df3, update_230, indicator='_23')

In [21]:
df3['title'] = df3['update_160']
updates = ['update_160', 'update_170', 'update_180', 'update_190',
           'update_200', 'update_210',  'update_220', 'update_230']
versions = ['16.0', '17.0', '18.0', '19.0', '20.0', '21.0', '22.0', '23.0']
for x in updates[1:]:
    df3.title = np.where(df3.title.isnull(), df3[x], df3.title)

In [22]:
for version, update in zip(versions, updates):
    df3[update] = np.where(df3[update].notnull(), version, df3[update])

In [23]:
df3['version_2010'] = df3['update_160']
for x in updates[1:]:
    df3['version_2010'] = np.where(df3['version_2010'].isnull(), df3[x], df3['version_2010'])

In [24]:
mask = df3['_19'] == 'both'
df3['version_2010_1'] = df3[mask].loc[:, 'update_190']
for merge, update in zip(['_20', '_21', '_22', '_23'], updates[4:]):
    df3['version_2010_1'] = np.where((df3['version_2010_1'].isnull()) & (df3[merge] == 'both'),
                                      df3[update], df3['version_2010_1'])

In [25]:
to_drop = updates + ['_17', '_18', '_19', '_20', '_21', '_22', '_23']
df3.drop(to_drop, axis=1, inplace=True)
df3.fillna('', inplace=True)
df3.head()

,onetsoccode,title,version_2010,version_2010_1
0,11-3051.02,Geothermal Production Managers,16.0,
1,11-3071.03,Logistics Managers,16.0,22.0
2,11-9121.01,Clinical Research Coordinators,16.0,
3,13-1023.00,"Purchasing Agents, Except Wholesale, Retail, a...",16.0,
4,13-1081.01,Logistics Engineers,16.0,

__Merge all data into one__

In [26]:
def final_merge(df1, df2):
    temp = df1.merge(df2, how='outer', on='onetsoccode')
    temp['title_x'] = np.where(temp['title_x'].isnull(),
                               temp['title_y'], temp['title_x'])
    temp.drop(['title_y'], axis=1, inplace=True)
    temp.rename(columns={'title_x' : 'title'}, inplace=True)
    return temp

In [27]:
df_final = final_merge(df, df1)
df_final = final_merge(df_final, df2)
df_final = final_merge(df_final, df3)
df_final.fillna('', inplace=True)

In [28]:
df_final.head()

,onetsoccode,title,version_2000,version_2006,version_2006_1,version_2009,version_2010,version_2010_1
0,11-2022.00,Sales Managers,5.0,13.0,,,21.0,
1,11-3011.00,Administrative Services Managers,5.0,,,14.0,22.0,
2,11-3051.00,Industrial Production Managers,5.0,13.0,,,18.0,
3,11-9111.00,Medical and Health Services Managers,5.0,13.0,,,21.0,
4,13-1022.00,"Wholesale and Retail Buyers, Except Farm Products",5.0,,,14.0,20.0,

In [29]:
df_final.to_csv('onet_update_tracking.csv')